In [65]:
import pandas as pd
import numpy as np
t=pd.Series([1,2,4,5,76,67,7])
print(t)
type(t)

0     1
1     2
2     4
3     5
4    76
5    67
6     7
dtype: int64

pandas.core.series.Series

In [66]:
temp_dict={"name":"xiaoliu","age":33,"salary":20000}
t2=pd.Series(temp_dict)
print(t2)

name      xiaoliu
age            33
salary      20000
dtype: object

In [67]:
df=pd.read_csv("D:/study/ml/数据分析资料/数据分析资料/day04/code/dogNames2.csv")
print(df)

      Row_Labels  Count_AnimalName
0              1                 1
1              2                 2
2          40804                 1
3          90201                 1
4          90203                 1
...          ...               ...
16215      37916                 1
16216      38282                 1
16217      38583                 1
16218      38948                 1
16219      39743                 1

[16220 rows x 2 columns]

In [68]:
t3=pd.DataFrame(np.arange(12).reshape(3,4),index=list("abc"),columns=list("efgh"))
print(t3)

   e  f   g   h
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [69]:
#dataframe中排序的方法
df=df.sort_values(by="Count_AnimalName",ascending=False)
print(df.head(10))

      Row_Labels  Count_AnimalName
1156       BELLA              1195
9140         MAX              1153
2660     CHARLIE               856
3251        COCO               852
12368      ROCKY               823
8417        LOLA               795
8552       LUCKY               723
8560        LUCY               710
2032       BUDDY               677
3641       DAISY               649

In [70]:
#pandas方括号写数组，表示取行
#写字符串，表示取索引
print(df[:20])
print(df[:10]["Row_Labels"])

      Row_Labels  Count_AnimalName
1156       BELLA              1195
9140         MAX              1153
2660     CHARLIE               856
3251        COCO               852
12368      ROCKY               823
8417        LOLA               795
8552       LUCKY               723
8560        LUCY               710
2032       BUDDY               677
3641       DAISY               649
11703   PRINCESS               603
829       BAILEY               532
9766       MOLLY               519
14466      TEDDY               485
2913       CHLOE               465
14779       TOBY               446
8620        LUNA               432
6515        JACK               425
8788      MAGGIE               393
13762     SOPHIE               383
1156       BELLA
9140         MAX
2660     CHARLIE
3251        COCO
12368      ROCKY
8417        LOLA
8552       LUCKY
8560        LUCY
2032       BUDDY
3641       DAISY
Name: Row_Labels, dtype: object

In [71]:
t3.loc['a']['f']

1

In [72]:
t3.iloc[[1],[2]]

   g
b  6

In [73]:
df[(df["Count_AnimalName"]<1000)&(df["Count_AnimalName"]>800)]

      Row_Labels  Count_AnimalName
2660     CHARLIE               856
3251        COCO               852
12368      ROCKY               823

In [74]:
pd.isnull(t3)

       e      f      g      h
a  False  False  False  False
b  False  False  False  False
c  False  False  False  False

In [75]:
t3['e']=np.nan
print(t3)

    e  f   g   h
a NaN  1   2   3
b NaN  5   6   7
c NaN  9  10  11

In [76]:
t3.fillna(t.median())

     e  f   g   h
a  5.0  1   2   3
b  5.0  5   6   7
c  5.0  9  10  11

print(t3)

In [79]:
print(t3['e'].mean())

nan